# SketchingInTheWrongView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SketchingInTheWrongView Property
BuiltInFailures..::..SketchFailures Class See Also
---
Detail sketch is only editable in [View Type].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchingInTheWrongView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchingInTheWrongView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchingInTheWrongView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace